<?php
//运算符
    1.算术运算符： + - * / % ** 
        2**3表示2的3次方等于8 
    2.递增递减运算符++ --  
        整数型，浮点型支持递增递减运算符，布尔型不支持，null，字符串只支持递增运算符
        ord($str)----返回指定字符的ASCII码值
        chr(98)---返回编码对应的字符
    3.字符连接符
        英文的.代表连接符
    4.赋值运算符
        = += -= /= %= *= .=
        mt_rand(1,9) //产生1到9的随机数
    5.比较运算符
        比较运算符的结果是true或false
        null检测符，如果这个值为null,就向下检测
    6.逻辑运算符
        逻辑运算符的结果是true或false
        && || ！ xor逻辑异或
        （1）逻辑与：如果第一个表达式为false，那么结果就为false，那么第二个表达式就执行不到
        （2）逻辑或：如果第一个表达式为true，整个结果就为true，第二个表达式就不执行了
    7.错误抑制符
        @ //把@加到产生错误的语句之前，就不会弹出错误

    8.想改变运算符优先级
        （1）可以通过()改变优先级
        （2）有短路的情况有限考虑短路